@sam-humphreys  I can't repro with below config.

```tf
resource "google_project" "project" {
  name            = "issue8767"
  project_id      = "issue8767"
  org_id     = "xxxxxxxxx"
  labels          = {
    "project_owner" = "samhumphreys"
    "test"                  = "no"
  }
}

data "google_storage_transfer_project_service_account" "stj-gmex-ex-20210325-state" {
  project = google_project.project.project_id
}
```

What did you do below plan? Can you post the plan after only a single change is made in label field?
```
  # google_storage_bucket_iam_member.stj-gmex-ex-20210325-state-reader must be replaced
-/+ resource "google_storage_bucket_iam_member" "stj-gmex-ex-20210325-state-reader" {
      ~ bucket = "b/gmex-ex-20210325-state" -> "gmex-ex-20210325-state"
      ~ etag   = "CAI=" -> (known after apply)
      ~ id     = "b/gmex-ex-20210325-state/roles/storage.admin/serviceaccount:project-473444228554@storage-transfer-service.iam.gserviceaccount.com" -> (known after apply)
      ~ member = "serviceAccount:project-473444228554@storage-transfer-service.iam.gserviceaccount.com" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }
```